package com.bsoft.assistant.constants;

import com.bsoft.assistant.utils.CreateFileUtils;

import java.util.HashMap;
import java.util.Map;

/**
 * Created by
 * tuz
 * on 2022/1/24.
 */
public class Const {
    public final static String BETWEEN_EXPRESSION = "between %s and %s";
    public final static String LIKE_EXPRESSION = "like";
    public final static String IN = "in";


    ///下面所有代码均是性能测试生成的脚本数据
    static String[] orgNames = {"机构一", "机构二", "机构三", "机构四", "机构五", "机构六", "机构七", "机构八", "机构九", "机构十"};
    static Map<String, String> orgIdMap = new HashMap<String, String>() {{
        put("机构一", "0");
        put("机构二", "1");
        put("机构三", "2");
        put("机构四", "3");
        put("机构五", "4");
        put("机构六", "5");
        put("机构七", "6");
        put("机构八", "7");
        put("机构九", "8");
        put("机构十", "9");

    }};

    //造性能测试脚本 科室/机构 生成脚本 t_test_org
    public static void main2(String[] args) {
        StringBuilder stringBuilder = new StringBuilder();
        String sqlFmt = "INSERT INTO `t_test_org` VALUES ('%s', '%s');\n";

        for (int i = 0; i < orgNames.length; i++) {
            stringBuilder.append(String.format(sqlFmt, orgIdMap.get(orgNames[i]), orgNames[i]));
        }
        CreateFileUtils.createFile("性能测试_t_test_org", "sql", "C:\\Users\\Administrator\\Desktop", stringBuilder.toString());
    }

    static String[] deptNames = {"全科", "骨科", "内科", "外科", "神经科", "妇科"
            , "儿科", "呼吸科", "消化科", "血液科", "内分泌科", "肝胆科"};

    //    static Map<String,String> deptIdMap = new HashMap<String,String>(){{
//        put("全科","0");
//        put("骨科","1");
//        put("内科","2");
//        put("外科","3");
//        put("神经科","4");
//        put("妇科","5");
//        put("儿科","6");
//        put("呼吸科","7");
//        put("消化科","8");
//        put("血液科","9");
//        put("内分泌科","10");
//        put("肝胆科","11");
//    }};
    //造性能测试脚本 科室/机构 生成脚本 t_test_dept
    public static void main1(String[] args) {
        StringBuilder stringBuilder = new StringBuilder();
        String sqlFmt = "INSERT INTO `t_test_dept` VALUES ('%s', '%s','%s');\n";
        for (int j = 0; j < orgNames.length; j++) {
            for (int i = 0; i < deptNames.length; i++) {
                stringBuilder.append(String.format(sqlFmt, j + "" + i, deptNames[i], orgIdMap.get(orgNames[j])));
            }
        }
        CreateFileUtils.createFile("性能测试_t_test_dept", "sql", "C:\\Users\\Administrator\\Desktop", stringBuilder.toString());
    }

    static String[] firstName =
           {
            "赵", "钱", "孙", "李", "周", "吴", "郑", "王",
            "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨",
            "朱", "秦", "尤", "许", "何", "吕", "施", "张",
            "孔", "曹", "严", "华", "金", "魏", "陶", "姜",
            "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
            "云", "苏", "潘", "葛", "奚", "范", "彭", "郎",
            "鲁", "韦", "昌", "马", "苗", "凤", "花", "方",
            "俞", "任", "袁", "柳", "酆", "鲍", "史", "唐",
            "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤",
            "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
            "乐", "于", "时", "傅", "皮", "卞", "齐", "康",
            "伍", "余", "元", "卜", "顾", "孟", "平", "黄",
            "和", "穆", "萧", "尹", "姚", "邵", "湛", "汪",
            "祁", "毛", "禹", "狄", "米", "贝", "明", "臧",
            "计", "伏", "成", "戴", "谈", "宋", "茅", "庞",
            "熊", "纪", "舒", "屈", "项", "祝", "董", "梁",
            "杜", "阮", "蓝", "闵", "席", "季", "麻", "强",
            "贾", "路", "娄", "危", "江", "童", "颜", "郭",
            "梅", "盛", "林", "刁", "钟", "徐", "邱", "骆",
            "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍",
            "虞", "万", "支", "柯", "昝", "管", "卢", "莫",
            "经", "房", "裘", "缪", "干", "解", "应", "宗",
            "丁", "宣", "贲", "邓", "郁", "单", "杭", "洪",
            "包", "诸", "左", "石", "崔", "吉", "钮", "龚",
            "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁",
            "荀", "羊", "於", "惠", "甄", "曲", "家", "封",
            "芮", "羿", "储", "靳", "汲", "邴", "糜", "松",
            "井", "段", "富", "巫", "乌", "焦", "巴", "弓",
            "牧", "隗", "山", "谷", "车", "侯", "宓", "蓬",
            "全", "郗", "班", "仰", "秋", "仲", "伊", "宫",
            "宁", "仇", "栾", "暴", "甘", "钭", "厉", "戎",
            "祖", "武", "符", "刘", "景", "詹", "束", "龙",
            "叶", "幸", "司", "韶", "郜", "黎", "蓟", "薄",
            "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂",
            "索", "咸", "籍", "赖", "卓", "蔺", "屠", "蒙",
            "池", "乔", "阴", "鬱", "胥", "能", "苍", "双",
            "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄",
            "姬", "申", "扶", "堵", "冉", "宰", "郦", "雍",
            "郤", "璩", "桑", "桂", "濮", "牛", "寿", "通",
            "边", "扈", "燕", "冀", "郏", "浦", "尚", "农",
            "温", "别", "庄", "晏", "柴", "瞿", "阎", "充",
            "慕", "连", "茹", "习", "宦", "艾", "鱼", "容",
            "向", "古", "易", "慎", "戈", "廖", "庾", "终",
            "暨", "居", "衡", "步", "都", "耿", "满", "弘",
            "匡", "国", "文", "寇", "广", "禄", "阙", "东",
            "欧", "殳", "沃", "利", "蔚", "越", "夔", "隆",
            "师", "巩", "厍", "聂", "晁", "勾", "敖", "融",
            "冷", "訾", "辛", "阚", "那", "简", "饶", "空",
            "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰",
            "巢", "关", "蒯", "相", "查", "后", "荆", "红",
            "游", "竺", "权", "逯", "盖", "益", "桓", "公",
            "万俟", "司马", "上官", "欧阳",
            "夏侯", "诸葛", "闻人", "东方",
            "赫连", "皇甫", "尉迟", "公羊",
            "澹台", "公冶", "宗政", "濮阳",
            "淳于", "单于", "太叔", "申屠",
            "公孙", "仲孙", "轩辕", "令狐",
            "钟离", "宇文", "长孙", "慕容",
            "鲜于", "闾丘", "司徒", "司空",
            "丌官", "司寇", "仉督", "子车",
            "颛孙", "端木", "巫马", "公西",
            "漆雕", "乐正", "壤驷", "公良",
            "拓跋", "夹谷", "宰父", "谷梁",
            "晋", "楚", "闫", "法", "汝", "鄢", "涂", "钦",
            "段", "干", "百", "里", "东", "郭", "南", "门",
            "呼", "延", "归", "海", "羊", "舌", "微", "生",
            "岳", "帅", "缑", "亢", "况", "郈", "有", "琴",
            "梁", "丘", "左", "丘", "东", "门", "西门",
            "商", "牟", "佘", "佴", "伯", "赏", "南", "宫",
            "墨", "哈", "谯", "笪", "年", "爱", "阳", "佟"};
    static String[] lastName = {
            "兵", "斌", "冰", "德", "智", "志",
            "复", "凯", "明", "红", "欢", "宗",
            "京", "洋", "阳", "宇", "卓", "君",
            "群", "琼", "琳", "迁", "彪", "容",
            "科", "宏", "汉", "武", "大", "欣",
            "瑶", "怡", "鹭", "正", "歌", "丹",
            "三", "峰", "丰", "风", "凌", "民",
            "军", "娟", "慧", "飞", "天", "顶",
            "紫", "嫣", "烟", "新", "州", "林",
            "山", "鑫", "金", "木", "水", "火",
            "鸣", "海", "江", "玉", "繁", "星",
            "泉", "芬", "芳", "果", "阵", "子",
            "雄", "卿", "建", "剑", "波", "涛",
            "惊", "云", "一", "二", "四", "五",
            "伍", "狗", "毛", "玲", "花", "千",
            "骨", "子", "默", "墨", "香", "锦",
            "狼", "成", "齐", "棋", "琴", "魂",
            "伦", "功", "向", "华", "蛋", "弹",
            "旭", "树", "铭", "国", "安", "强",
    };

    //造医生表数据生成脚本 t_test_doctor
    public static void main3(String[] args) {
        StringBuilder stringBuilder = new StringBuilder();
        String sqlFmt = "INSERT INTO `t_test_doctor` VALUES ('%s', '%s', %d, '%s', '%s');\n";
        int start = 0;
        int end = 10000;
        for (int i = start; i < end; i++) {
            int age = (int) (Math.random() * 100) % 11 + 30;
            String sex = (i + age) % 2 == 0 ? "女" : "男";
            int orgIndex = (int) (Math.random() * 100) % orgNames.length;
            int deptIndex = (int) (Math.random() * 100) % deptNames.length;
            String deptId = orgIndex + "" + deptIndex;
            stringBuilder.append(String.format(sqlFmt, i + "", generatePersonName(), age, sex, deptId));
//            System.out.println();
        }
        CreateFileUtils.createFile("性能测试_t_test_doctor", "txt", "C:\\Users\\Administrator\\Desktop", stringBuilder.toString());
    }


    static String[] results = {"正常", "指标偏高", "异常"};
    static String[] remarks = {"未见明显异常", "部分指标偏高，建议阶段复查", "指标明显出现异常，随时有生命危险，建议住院治疗"};

    //造就诊记录表数据生成脚本 t_test_record
    public static void main999(String[] args) {
        StringBuilder stringBuilder = new StringBuilder();
        String sqlFmt = "INSERT INTO `t_test_record` VALUES ('%s', '%s', '%s', '%s', '%s', %d, '%s');\n";
        int start = 8000000;
        int end = 10000000;
        for (int i = start; i < end; i++) {
            String id = i + "";
            String docId = (int) (Math.random() * 140000) % 10000 + "";
            int ramd = (int) (Math.random() * 100) % 3;
            String res = results[ramd];
            String rem = remarks[ramd];
            int age = (int) (Math.random() * 100) % 75;
            age = age > 3 ? age + 15 : age + 3;
            String sex = (i + age) % 2 == 0 ? "女" : "男";
            stringBuilder.append(String.format(sqlFmt, id, docId, generatePersonName(), res, rem, age, sex));
        }
        CreateFileUtils.createFile("性能测试14_t_test_record", "sql", "C:\\Users\\Administrator\\Desktop", stringBuilder.toString());
    }

    //造就诊记录明细表数据生成脚本 t_test_record_detail
    public static void main444(String[] args) {
        StringBuilder stringBuilder = new StringBuilder();
        String sqlFmt = "INSERT INTO `t_test_record_detail` VALUES ('%s', '%s', '%s', '%d', '%s', '%s', '%s', '%d');\n";
        int medCount = medInfoMap.keySet().size();

        int start = 9600000;
        int end = 9800000;
        int idIndex = 101289816;
        for (int i = start; i < end; i++) {  //i is recordId
            int detailCount = (int) (Math.random() * 100) % 13;  //detail数量大于等于7小于13
            if (detailCount < 7) detailCount += 7;

            for (int j=0;j<detailCount;j++) {
                String[] medInfo = null;
                while (medInfo==null || medInfo.length != 5){
                    String medKey = (int) (Math.random() * 1000) % medCount + "";
                    medInfo = medInfoMap.get(medKey);
                    if (medInfo != null && medInfo.length ==5){
                        int medNum = (int) (Math.random() * 100) % 7 + 1;
                        String id = idIndex++ + "";
                        stringBuilder.append(String.format(sqlFmt, id, medInfo[0], medInfo[1], i, medInfo[2], medInfo[3], medInfo[4], medNum));
                    }
                }
            }
        }
        CreateFileUtils.createFile("性能测试51_t_test_record_detail", "sql", "C:\\Users\\Administrator\\Desktop", stringBuilder.toString());
        System.out.println(String.format("id最大值为：%d",idIndex));
    }

    static String generatePersonName() {
        int random = (int) (Math.random() * 1000);

        String name = firstName[random % firstName.length];

        random = (int) (Math.random() * 1000);
        name = name + lastName[random % lastName.length];

        random = (int) (Math.random() * 1000);
        if (random % 3 == 2) { //三个后面的字
            name = name + lastName[random % lastName.length];
        }
        return name;
    }

    static int i = 47;
    static Map<String, String[]> medInfoMap = new HashMap<String, String[]>() {
        {
            put("0", new String[]{"布洛芬缓释胶囊", "0.3克*24粒", "南京易亨制药有限公司", "5.39", "盒"});
            put("1", new String[]{"酚麻美敏片", "20片", "上海强生制药有限公司", "13.47", "盒"});
            put("2", new String[]{"复方对乙酰氨基酚片(Ⅱ)[散利痛]", "10片", "拜耳医药保健有限公司委托山东新华制药", "5.79", "盒"});
            put("3", new String[]{"复方盐酸伪麻黄碱缓释胶囊[新康泰克]", "8粒", "中美天津史克制药有限公司", "7.78", "盒"});
            put("4", new String[]{"布洛芬混悬液[美林]", "30ml*1ml", "上海强生制药有限公司", "5.74", "瓶"});
            put("5", new String[]{"氯雷他定片[开瑞坦]", "10mg*6片", "拜耳医药（上海）有限公司", "14.98", "盒"});
            put("6", new String[]{"氯苯那敏片", "4mg*100片", "江苏鹏鹞药业有限公司", "9.50", "盒"});
            put("7", new String[]{"盐酸西替利嗪片[希瓦丁]", "10毫克*24片", "苏州中化药品工业有限公司", "2.95", "盒"});
            put("8", new String[]{"复方消化酶胶囊", "20粒", "广东星昊药业有限公司", "30.42", "盒"});
            put("9", new String[]{"复合乳酸菌肠溶胶囊", "0.33g*12粒", "江苏美通制药有限公司", "21.38", "盒"});
            put("10", new String[]{"多库酯钠片", "100毫克*12片", "湖南华纳大药厂股份有限公司", "44.72", "盒"});
            put("11", new String[]{"复方嗜酸乳杆菌片[益君康]", "0.5g*18片", "通化金马药业集团股份有限公司", "27.97", "盒"});
            put("12", new String[]{"蒙脱石散[肯特令]", "3g*12袋", "浙江海力生制药有限公司", "3.95", "盒"});
            put("13", new String[]{"小檗碱片", "0.1g*100片", "东北制药集团沈阳第一制药有限公司", "28.00", "瓶"});
            put("14", new String[]{"多酶片", "100片", "浙江国光生物制药有限公司", "5.90", "瓶"});
            put("15", new String[]{"多潘立酮片", "10毫克*30片", "辅仁药业集团有限公司", "5.89", "盒"});
            put("16", new String[]{"多潘立酮片[吗丁啉]", "10mg*42片", "西安杨森制药有限公司", "17.42", "盒"});
            put("17", new String[]{"奥美拉唑肠溶胶囊", "20毫克*14粒", "海南海灵化学制药有限公司", "2.15", "瓶"});
            put("18", new String[]{"雷贝拉唑钠肠溶片", "10毫克*14片", "双鹤药业（海南）有限责任公司", "3.50", "盒"});
            put("19", new String[]{"碳酸氢钠片", "0.5克*100片", "天津力生制药股份有限公司", "8.38", "盒"});
            put("20", new String[]{"莫沙必利片[瑞琪]", "5mg*24片", "江苏豪森制药有限公司", "11.06", "盒"});
            put("21", new String[]{"铝碳酸镁咀嚼片", "0.5克*24片", "广东华润顺峰药业有限公司", "7.26", "盒"});
            put("22", new String[]{"甲巯咪唑片[赛治]", "10mg*50片", "德国默克", "26.60", "盒"});
            put("23", new String[]{"秋水仙碱片", "1mg*20片", "昆药集团股份有限公司", "11.32", "盒"});
            put("24", new String[]{"阿托品片", "0.3mg*100片", "杭州民生药业有限公司", "28.00", "瓶"});
            put("25", new String[]{"别嘌醇片", "0.1g*100片", "世贸天阶制药（江苏）有限责任公司", "92.00", "瓶"});
            put("26", new String[]{"苯溴马隆片[立加利仙]", "50mg*10片", "昆山龙灯瑞迪制药有限公司", "24.26", "盒"});
            put("27", new String[]{"谷维素片", "10mg*100片", "杭州益品新五丰药业有限公司", "21.79", "瓶"});
            put("28", new String[]{"维生素B1片", "10mg*100片", "广东恒健制药有限公司", "9.50", "瓶"});
            put("29", new String[]{"维生素B2片", "5mg*100片", "广东恒健制药有限公司", "10.00", "瓶"});
            put("30", new String[]{"维生素B6片", "10毫克*100片", "杭州民生药业有限公司", "7.41", "瓶"});
            put("31", new String[]{"硒酵母片[西维尔]", "50ug*60片", "牡丹江灵泰药业股份有限公司", "38.25", "盒"});
            put("32", new String[]{"维生素C片", "0.1g*100片", "浙江瑞新药业有限公司", "13.57", "瓶"});
            put("33", new String[]{"维生素E软胶囊[天然型]", "0.1g*30粒", "浙江医药股份有限公司新昌制药厂", "14.95", "盒"});
            put("34", new String[]{"复合维生素B片", "100片", "瑞阳制药有限公司", "13.00", "瓶"});
            put("35", new String[]{"叶酸片", "5mg*100片", "常州制药厂有限公司", "18.60", "瓶"});
            put("36", new String[]{"维生素AD滴剂[伊可新]", "2000单位*40粒", "山东达因海洋生物制药股份有限公司", "21.20", "盒"});
            put("37", new String[]{"阿法骨化醇软胶囊[阿法迪三]", "0.25μg*20粒", "昆明贝克诺顿制药有限公司", "20.79", "盒"});
            put("38", new String[]{"碳酸钙D3片[钙尔奇D]", "0.6g*30片", "惠氏制药有限公司", "27.04", "瓶"});
            put("39", new String[]{"谷胱甘肽片[阿拓莫兰]", "0.1克*36片", "重庆药友制药有限责任公司", "60.07", "瓶"});
            put("40", new String[]{"非那雄胺片[艾仕列]", "5毫克*30片", "杭州康恩贝制药有限公司", "5.21", "盒"});
            put("41", new String[]{"盐酸坦索罗辛缓释胶囊[齐索]", "0.2毫克*20粒", "浙江海力生制药有限公司", "8.97", "盒"});
            put("42", new String[]{"恩替卡韦分散片[瑞夫恩]", "0.5mg*21片", "苏州东瑞制药有限公司", "3.83", "盒"});
            put("43", new String[]{"维生素D2软胶囊", "400单位*20粒", "大连水产药业有限公司", "57.99", "盒"});
            put("44", new String[]{"聚卡波非钙片[利波非]", "0.5g*18片", "苏州中化药品工业有限公司", "60.91", "盒"});
            put("45", new String[]{"复方聚乙二醇电解质散剂[舒泰清]", "12袋", "舒泰神（北京）生物制药股份有限公司", "52.00", "盒"});
            put("46", new String[]{"葡萄糖酸亚铁糖浆", "0.3g/10ml*10支", "浙江天一堂药业有限公司", "9.41", "盒"});
            put(i++ + "", new String[]{"聚乙二醇4000散","10克*10袋","马应龙药业集团股份有限公司","7.39","盒"});
            put(i++ + "", new String[]{"泼尼松片","5mg*100片","浙江仙居制药有限公司","6.28","瓶"});
            put(i++ + "", new String[]{"酒石酸伐尼克兰片-维持[畅沛]","1mg*28片","Pfizer Australia Pty Limited","288.77","盒"});
            put(i++ + "", new String[]{"乙酰半胱氨酸泡腾片","0.6g*6片","金华康恩贝制药有限公司","23.43","盒"});
            put(i++ + "", new String[]{"复方甘草片","4mg*100片","宁波大红鹰药业股份有限公司","18.98","瓶"});
            put(i++ + "", new String[]{"卡托普利片","25毫克*100片","华中药业股份有限公司","1.79","瓶"});
            put(i++ + "", new String[]{"卡托普利片","25mg*100片","浙江得恩德制药有限公司","2.40","瓶"});
            put(i++ + "", new String[]{"复方甲氧那明胶囊[阿斯美]","60粒","第一三共制药(上海)有限公司","37.48","瓶"});
            put(i++ + "", new String[]{"硫酸沙丁胺醇雾化吸入溶液[达芬科闯]","20ml*1瓶","深圳大佛药业有限公司","124.42","瓶"});
            put(i++ + "", new String[]{"孟鲁司特钠片","10mg*5片","杭州民生滨江制药有限公司","18.96","盒"});
            put(i++ + "", new String[]{"盐酸氨溴索分散片[抒坦清]","30毫克*50片","山西仟源医药集团股份有限公司","5.25","盒"});
            put(i++ + "", new String[]{"阿司匹林肠溶片[拜阿司匹灵]","0.1g*30片","拜耳医药保健有限公司","15.05","盒"});
            put(i++ + "", new String[]{"单硝酸异山梨酯缓释片[欣康]","40毫克*36片","鲁南贝特制药有限公司","33.25","盒"});
            put(i++ + "", new String[]{"单硝酸异山梨酯缓释片[欣康]","40mg*24片","鲁南贝特制药有限公司","42.19","盒"});
            put(i++ + "", new String[]{"盐酸普萘洛尔缓释片","40毫克*24片","亚宝药业集团股份有限公司","62.25","盒"});
            put(i++ + "", new String[]{"硝苯地平缓释片[伲福达]","20mg*30片","青岛黄海制药有限责任公司","17.40","瓶"});
            put(i++ + "", new String[]{"硝酸异山梨酯片[消心痛]","5mg*100片","上海衡山药业有限公司","14.95","瓶"});
            put(i++ + "", new String[]{"盐酸曲美他嗪片[根克通]","20毫克*30片","瑞阳制药有限公司","2.59","盒"});
            put(i++ + "", new String[]{"硝酸甘油片","0.5mg*100片","北京益民药业有限公司","38.00","瓶"});
            put(i++ + "", new String[]{"螺内酯片","20mg*100片","杭州民生药业有限公司","13.80","瓶"});
            put(i++ + "", new String[]{"呋塞米片","20mg*100片","上海朝晖药业有限公司","21.00","瓶"});
            put(i++ + "", new String[]{"替米沙坦片[美卡素]","80mg*7片","德国勃林格殷格翰","24.87","盒"});
            put(i++ + "", new String[]{"马来酸左旋氨氯地平片[玄宁]","2.5mg*14片","石家庄欧意药业有限公司","26.95","盒"});
            put(i++ + "", new String[]{"厄贝沙坦氢氯噻嗪片[依伦平]","162.5mg*14片","南京正大天晴制药有限公司","14.28","盒"});
            put(i++ + "", new String[]{"琥珀酸美托洛尔缓释片[倍他乐克]","47.5mg*7片","阿斯利康制药有限公司","14.70","盒"});
            put(i++ + "", new String[]{"辛伐他汀片[京必舒新]","20毫克*28片","浙江京新药业股份有限公司","2.96","盒"});
            put(i++ + "", new String[]{"尼莫地平片","20mg*30片","正大青春宝药业有限公司","15.00","盒"});
            put(i++ + "", new String[]{"盐酸胺碘酮片[可达龙]","0.2g*10片","杭州赛诺菲安万特民生制药有限公司","23.73","盒"});
            put(i++ + "", new String[]{"瑞舒伐他汀钙片","10mg*30片","斯洛文尼亚莱柯制药LekPharmaceutica山","6.84","盒"});
            put(i++ + "", new String[]{"盐酸贝那普利片[信达怡]","5毫克*28片","深圳信立泰药业股份有限公司","15.31","盒"});
            put(i++ + "", new String[]{"盐酸贝那普利片[洛汀新]","10mg*14片","北京诺华制药有限公司","31.35","盒"});
            put(i++ + "", new String[]{"普萘洛尔片[心得安]","10mg*100片","江苏亚邦爱普森药业有限公司","23.80","瓶"});
            put(i++ + "", new String[]{"苯磺酸氨氯地平片[安内真]","5mg*21片","苏州东瑞制药有限公司","1.19","盒"});
            put(i++ + "", new String[]{"富马酸比索洛尔片","2.5毫克*18片","成都苑东生物制药股份有限公司","6.15","盒"});
            put(i++ + "", new String[]{"缬沙坦片[倍泽]","40毫克*28片","浙江华海药业股份有限公司","3.61","盒"});
            put(i++ + "", new String[]{"厄贝沙坦片[伊达力]","0.15g*12片","瀚晖制药有限公司","3.91","盒"});
            put(i++ + "", new String[]{"阿托伐他汀钙片","20mg*14片","齐鲁制药（海南）有限公司","2.86","盒"});
            put(i++ + "", new String[]{"辅酶Q10胶囊","10mg*60粒","上海旭东海普药业有限公司","15.60","瓶"});
            put(i++ + "", new String[]{"硫酸氢氯吡格雷片","75mg*14片","石药集团欧意药业有限公司","34.12","盒"});
            put(i++ + "", new String[]{"氯化钾颗粒","1.57克*6袋","重庆药友制药有限责任公司","55.92","盒"});
            put(i++ + "", new String[]{"坎地沙坦酯片[搏力高]","8毫克*28片","浙江永宁药业股份有限公司","7.20","盒"});
            put(i++ + "", new String[]{"非洛地平缓释片[波依定]","5mg*10片","阿斯利康制药有限公司","27.67","盒"});
            put(i++ + "", new String[]{"氯化钾缓释片[补达秀]","0.5克*48片","广州誉东健康制药有限公司","18.17","盒"});
            put(i++ + "", new String[]{"氯化钾缓释片","0.5g*48片","深圳市中联制药有限公司","8.86","盒"});
            put(i++ + "", new String[]{"孟鲁司特钠咀嚼片","4毫克*14片","齐鲁制药（海南）有限公司","2.98","盒"});
            put(i++ + "", new String[]{"普瑞巴林胶囊[莱瑞克]","75毫克*10粒","重庆赛维药业有限公司","64.93","盒"});
            put(i++ + "", new String[]{"吡贝地尔缓释片[泰舒达]","50mg*30片","法国Les Laboratoires Servier Iindust","72.74","盒"});
            put(i++ + "", new String[]{"恩他卡朋片[珂丹]","0.2g*30片","芬兰Orion Corporation","216.59","瓶"});
            put(i++ + "", new String[]{"巴氯芬片[郝智]","10mg*20片","卫达化学制药股份有限公司","32.42","盒"});
            put(i++ + "", new String[]{"盐酸司来吉兰片[咪多吡]","5mg*100片","芬兰Orion Corporation","320.99","盒"});
            put(i++ + "", new String[]{"盐酸金刚烷胺片","0.1g*100片","江苏鹏鹞药业有限公司","20.00","瓶"});
            put(i++ + "", new String[]{"盐酸氟桂利嗪胶囊[西比灵]","5mg*20粒","西安杨森制药有限公司","21.16","盒"});
            put(i++ + "", new String[]{"塞来昔布胶囊[优得宁]","0.2克*30粒","石药集团欧意药业有限公司","9.38","瓶"});
            put(i++ + "", new String[]{"普瑞巴林胶囊[乐瑞卡]","75mg*8粒","辉瑞制药有限公司","58.09","盒"});
            put(i++ + "", new String[]{"盐酸普拉克索片[森福罗]","0.25mg*30片","德国勃林格殷格翰","156.35","盒"});
            put(i++ + "", new String[]{"多巴丝肼片[美多芭]","40片","上海罗氏制药有限公司","77.10","盒"});
            put(i++ + "", new String[]{"地高辛片","0.25mg*30片","杭州赛诺菲民生制药有限公司","30.00","盒"});
            put(i++ + "", new String[]{"华法林钠片","2.5mg*60片","上海上药信谊药厂有限公司","18.00","盒"});
            put(i++ + "", new String[]{"盐酸吡格列酮分散片","15mg*30片","江苏万邦生化医药集团有限责任公司","36.12","瓶"});
            put(i++ + "", new String[]{"瑞格列奈片[孚来迪]","0.5mg*30片","江苏豪森制药有限公司","12.60","盒"});
            put(i++ + "", new String[]{"盐酸二甲双胍片","0.25克*60片","上海信谊天平药业有限公司","1.80","瓶"});
            put(i++ + "", new String[]{"阿卡波糖胶囊[贝希]","50毫克*30粒","四川绿叶制药股份有限公司","9.60","盒"});
            put(i++ + "", new String[]{"格列齐特缓释片[达美康]","30mg*30片","施维雅[天津]制药有限公司","42.04","盒"});
            put(i++ + "", new String[]{"盐酸二甲双胍片[格华止]","0.5g*20片","上海施贵宝制药有限公司","19.15","盒"});
            put(i++ + "", new String[]{"瑞格列奈片[诺和龙]","1mg*30片","德国柏林格殷格翰药业公司Boehringer","I","40.07","盒"});
            put(i++ + "", new String[]{"格列美脲片[佑苏]","2毫克*60片","扬子江药业集团广州海瑞药业有限公司","4.64","盒"});
            put(i++ + "", new String[]{"头孢呋辛酯片[达力新]","0.25g*12片","国药集团致君(深圳)制药有限公司","4.28","盒"});
            put(i++ + "", new String[]{"阿莫西林胶囊","0.25克*30粒","石药集团中诺药业制药有限公司","2.16","盒"});
            put(i++ + "", new String[]{"头孢拉定胶囊","0.25克*24粒","山东新华制药股份有限公司","3.04","盒"});
            put(i++ + "", new String[]{"头孢克洛胶囊[可洛]","0.25克*12粒","苏州中化药品工业有限公司","6.90","盒"});
            put(i++ + "", new String[]{"阿奇霉素片[舒美特]","125mg*6片","普利瓦医药工业股份","有限公司","28.02","盒"});
            put(i++ + "", new String[]{"阿奇霉素片[希舒美]","0.25g*6片","辉瑞制药有限公司","47.64","盒"});
            put(i++ + "", new String[]{"头孢克洛干混悬剂[希刻劳]","0.125g*6袋","苏州西克罗制药有限公司","17.93","盒"});
            put(i++ + "", new String[]{"氧氟沙星片[泰利必妥]","0.1g*30片","第一三共制药（北京）有限公司","31.05","盒"});
            put(i++ + "", new String[]{"甲硝唑片","0.2克*21片","四川科伦药业股份有限公司","1.84","盒"});
            put(i++ + "", new String[]{"阿昔洛韦片","0.1克*12片","四川科伦药业股份有限公司","4.76","盒"});
            put(i++ + "", new String[]{"阿昔洛韦片","0.1g*24片","浙江亚太药业有限公司","5.93","盒"});
            put(i++ + "", new String[]{"诺氟沙星胶囊","0.1g*12粒","浙江医药股份有限公司新昌制药厂","0.82","板"});
            put(i++ + "", new String[]{"盐酸托莫西汀胶囊[择思达]","40mg*7粒","EliLily&Company Limited,英国","206.23","盒"});
            put(i++ + "", new String[]{"盐酸安非他酮缓释片","150mg*14片","万特制药(海南)有限公司","71.39","盒"});
            put(i++ + "", new String[]{"盐酸氯米帕明片","25mg*50片","江苏恩华药业股份有限公司","15.07","瓶"});
            put(i++ + "", new String[]{"盐酸曲唑酮片[舒绪]","50毫克*12片","沈阳福宁药业有限公司","27.76","盒"});
            put(i++ + "", new String[]{"氢溴酸西酞普兰胶囊[多弗]","20mg*14粒","四川科伦药业股份有限公司","35.97","盒"});
            put(i++ + "", new String[]{"盐酸安非他酮片[乐孚亭]","75mg*14片","万特制药(海南)有限公司","35.28","盒"});
            put(i++ + "", new String[]{"盐酸托莫西汀胶囊[择思达]","10mg*7粒","Eli Lily&Company Limited,英国","108.37","盒"});
            put(i++ + "", new String[]{"阿戈美拉汀片[阿美宁]","25mg*14片","江苏豪森制药有限公司","168.00","盒"});
            put(i++ + "", new String[]{"氟哌噻吨美利曲辛片[黛力新]","20片","丹麦灵北药厂","49.14","盒"});
            put(i++ + "", new String[]{"氢溴酸西酞普兰片[喜太乐]","20毫克*14片","四川科伦药业股份有限公司","35.97","盒"});
            put(i++ + "", new String[]{"盐酸米安色林片","30mg*12片","山东仁和堂药业有限公司","49.96","盒"});
            put(i++ + "", new String[]{"草酸艾司西酞普兰片[百适可]","5毫克*40片","山东京卫制药有限公司","135.53","盒"});
            put(i++ + "", new String[]{"盐酸文拉法辛缓释胶囊[文悦思]","75毫克*14粒","北京福元医药股份有限公司","35.80","盒"});
            put(i++ + "", new String[]{"盐酸舍曲林片[左洛复]","50mg*14片","辉瑞制药有限公司","72.49","盒"});
            put(i++ + "", new String[]{"氟哌噻吨美利曲辛片[圣美弗]","28片","重庆圣华曦药业有限公司","45.74","盒"});
            put(i++ + "", new String[]{"盐酸氟西汀胶囊[聚立能]","20mg*14粒","苏州中化药品工业有限公司","20.41","盒"});
            put(i++ + "", new String[]{"草酸艾司西酞普兰片[来士普]","10mg*7片","丹麦灵北制药有限公司","77.08","盒"});
            put(i++ + "", new String[]{"盐酸舍曲林片[唯他停]","50mg*14片","浙江京新药业股份有限公司","21.48","盒"});
            put(i++ + "", new String[]{"盐酸帕罗西汀肠溶缓释片","25毫克*30片","深圳信立泰药业股份有限公司","104.05","盒"});
            put(i++ + "", new String[]{"盐酸曲唑酮片[美时玉]","50mg*20片","美时化学制药股份有限公司","51.35","盒"});
            put(i++ + "", new String[]{"甘草酸二铵肠溶胶囊[天晴甘平]","50mg*63粒","江苏正大天晴药业股份有限公司","56.51","盒"});
            put(i++ + "", new String[]{"双环醇片[百赛诺]","25mg*18片","北京协和药厂","63.72","盒"});
            put(i++ + "", new String[]{"酒石酸美托洛尔片","50毫克*30片","远大医药（中国）有限公司","2.62","盒"});
            put(i++ + "", new String[]{"酒石酸美托洛尔片[倍他乐克]","25mg*20片","无锡阿斯特拉制药有限公司","6.05","盒"});
            put(i++ + "", new String[]{"左甲状腺素钠片[优甲乐]","50ug*100片","默克雅柏药业公司","24.88","盒"});
            put(i++ + "", new String[]{"甲钴胺分散片","0.5mg*24片","江苏四环生物制药有限公司","24.85","盒"});
            put(i++ + "", new String[]{"利可君片[利血生]","20mg*48片","江苏吉贝尔药业有限公司","47.99","盒"});
            put(i++ + "", new String[]{"甲磺酸倍他司汀片[敏使朗]","6mg*100片","卫材（中国）制药有限公司","36.25","盒"});
            put(i++ + "", new String[]{"盐酸乙哌立松片[妙纳]","50mg*20片","卫材（中国）制药有限公司","26.25","盒"});
            put(i++ + "", new String[]{"甲钴胺片[弥可保]","0.5毫克*100片","卫材（中国）制药有限公司","15.04","盒"});
            put(i++ + "", new String[]{"马来酸氟伏沙明片[瑞必乐]","50mg*30片","丽珠集团丽珠制药厂","64.47","盒"});
            put(i++ + "", new String[]{"枸橼酸坦度螺酮片[希德]","10mg*42片","住友制药[苏州]有限公司","112.34","盒"});
            put(i++ + "", new String[]{"盐酸帕罗西汀片[赛乐特]","20mg*10片","中美天津史克制药有限公司","69.75","盒"});
            put(i++ + "", new String[]{"氢溴酸伏硫西汀片[心达悦]","10mg*14片","丹麦灵北药厂","498.00","盒"});
            put(i++ + "", new String[]{"盐酸安非他酮缓释片[迪沙]","0.15克*12片","迪沙药业集团有限公司","60.90","盒"});
            put(i++ + "", new String[]{"盐酸文拉法辛缓释片[博乐欣]","75mg*14片","成都康弘药业集团股份有限公司","78.68","盒"});
            put(i++ + "", new String[]{"马来酸氟伏沙明片[兰释]","50mg*30片","荷兰苏威制药公司","88.76","盒"});
            put(i++ + "", new String[]{"艾司西酞普兰片[百适可]","10mg*7片","山东京卫制药有限公司","28.00","盒"});
            put(i++ + "", new String[]{"盐酸度洛西汀肠溶片[奥思平]","20mg*20片","上海上药中西制药有限公司","68.94","盒"});
            put(i++ + "", new String[]{"米氮平片[派迪生]","30mg*10片","华裕(无锡)制药有限公司","58.48","盒"});
            put(i++ + "", new String[]{"盐酸氟西汀分散片[百优解]","20mg*28片","法国Patheon France（苏州礼来分装）","194.46","盒"});
            put(i++ + "", new String[]{"盐酸氟西汀胶囊[百优解]","20mg*28粒","礼来苏州制药有限公司","162.06","盒"});
            put(i++ + "", new String[]{"盐酸丁螺环酮片[一舒]","5mg*60片","江苏恩华药业股份有限公司","35.93","盒"});
            put(i++ + "", new String[]{"盐酸舍曲林片[乐元]","50毫克*28片","浙江华海药业股份有限公司","38.92","盒"});
            put(i++ + "", new String[]{"盐酸帕罗西汀片[万生力乐]","20mg*20片","北京福元医药股份有限公司","32.35","盒"});
            put(i++ + "", new String[]{"盐酸氟西汀胶囊[奥麦伦]","20mg*14粒","上海上药中西制药有限公司","40.92","盒"});
            put(i++ + "", new String[]{"草酸艾司西酞普兰片[启程]","10毫克*14片","湖南洞庭药业股份有限公司","54.33","盒"});
            put(i++ + "", new String[]{"盐酸帕罗西汀片[乐友]","20mg*20片","浙江华海药业股份有限公司","31.18","盒"});
            put(i++ + "", new String[]{"米氮平片[瑞美隆]","30mg*10片","杭州默沙东制药有限公司分包装[荷兰欧?","105.74","盒"});
            put(i++ + "", new String[]{"盐酸文拉法辛缓释胶囊[怡诺思]","75mg*14片","辉瑞制药有限公司","79.63","盒"});
            put(i++ + "", new String[]{"盐酸度洛西汀肠溶胶囊[欣百达]","60mg*14粒","美国(U.S.A)","157.83","盒"});
            put(i++ + "", new String[]{"盐酸度洛西汀肠溶胶囊","20毫克*14粒","青岛百洋制药有限公司","8.25","盒"});
            put(i++ + "", new String[]{"氢溴酸西酞普兰片[喜普妙]","20mg*14片","西安杨森制药有限公司","108.47","盒"});
            put(i++ + "", new String[]{"枸橼酸坦度螺酮胶囊[律康]","5mg*48粒","四川科瑞德制药有限公司","51.64","盒"});
            put(i++ + "", new String[]{"阿立哌唑口服溶液[博思清]","50毫升*1瓶","成都康弘药业集团股份有限公司","82.00","瓶"});
            put(i++ + "", new String[]{"奥氮平口崩片[再普乐]","5mg*7片","Eli Lilly and Company Indianapolis","129.91","盒"});
            put(i++ + "", new String[]{"舒必利片","0.1g*100片","江苏恩华药业股份有限公司","31.41","瓶"});
            put(i++ + "", new String[]{"丙戊酸钠片","0.2g*100片","湖南省湘中制药有限公司","18.37","瓶"});
            put(i++ + "", new String[]{"富马酸喹硫平片[思瑞康]","0.2g*20片","阿斯利康制药有限公司","206.52","盒"});
            put(i++ + "", new String[]{"富马酸喹硫平缓释片[灵塑]","200毫克*21片","上海宣泰海门药业有限公司","71.19","瓶"});
            put(i++ + "", new String[]{"异丙嗪片","25毫克*100片","常州康普药业有限公司","25.80","瓶"});
            put(i++ + "", new String[]{"富马酸喹硫平片[太伦佐]","0.1克*20片","合肥英太制药有限公司","21.16","盒"});
            put(i++ + "", new String[]{"盐酸鲁拉西酮片[罗舒达]","40mg*7片","住友制药[苏州]有限公司","67.20","盒"});
            put(i++ + "", new String[]{"阿立哌唑片[奥派]","5mg*14片","上海上药中西制药有限公司","28.26","盒"});
            put(i++ + "", new String[]{"奥氮平片[再普乐]","5mg*28片","Elo","Lilly","and","Company","Ltd,UK","493.99","盒"});
            put(i++ + "", new String[]{"富马酸喹硫平片[思瑞康]","25mg*20片","阿斯利康制药有限公司","58.40","盒"});
            put(i++ + "", new String[]{"阿立哌唑片","10毫克*30片","江苏恩华药业股份有限公司","36.78","盒"});
            put(i++ + "", new String[]{"奥氮平片[奥兰之]","5mg*20片","印度瑞迪士实验有限公司","72.82","盒"});
            put(i++ + "", new String[]{"阿立哌唑口腔崩解片[博思清]","10毫克*20片","成都康弘药业集团股份有限公司","93.00","盒"});
            put(i++ + "", new String[]{"富马酸喹硫平缓释片","200毫克*20片","阿斯利康制药有限公司","175.00","盒"});
            put(i++ + "", new String[]{"利培酮片[维思通]","1mg*20片","西安杨森制药有限公司","39.35","盒"});
            put(i++ + "", new String[]{"富马酸喹硫平片[启维]","25毫克*28片","湖南洞庭药业股份有限公司","11.00","盒"});
            put(i++ + "", new String[]{"氨磺必利片[帕可]","0.2g*20片","齐鲁制药有限公司","86.57","盒"});
            put(i++ + "", new String[]{"氨磺必利片","200毫克*20片","厦门力卓药业有限公司","43.20","盒"});
            put(i++ + "", new String[]{"氯氮平片","25mg*100片","湖南洞庭药业股份有限公司","17.47","瓶"});
            put(i++ + "", new String[]{"盐酸苯海索片[安坦]","2mg*100片","天津力生制药股份有限公司","24.07","瓶"});
            put(i++ + "", new String[]{"布南色林片[洛珊]","4mg*10片","住友制药[苏州]有限公司","46.80","盒"});
            put(i++ + "", new String[]{"氯丙嗪片","25mg*100片","常州康普药业有限公司","10.93","瓶"});
            put(i++ + "", new String[]{"利培酮口服液[单克]","30mg/30ml*30毫升","常州四药制药有限公司","44.80","瓶"});
            put(i++ + "", new String[]{"盐酸硫必利片","0.1g*100片","江苏恩华药业股份有限公司","22.60","瓶"});
            put(i++ + "", new String[]{"阿立哌唑口腔崩解片[博思清]","5mg*20片","成都康弘药业集团股份有限公司","43.99","盒"});
            put(i++ + "", new String[]{"盐酸齐拉西酮胶囊[卓乐定]","40mg*10粒","Pfizer Australia Pty Limited","125.05","盒"});
            put(i++ + "", new String[]{"氨磺必利片[索里昂]","0.2g*20片","杭州赛诺菲安万特民生制药有限公司","241.70","盒"});
            put(i++ + "", new String[]{"盐酸阿米替林片","25mg*100片","常州四药制药有限公司","19.21","瓶"});
            put(i++ + "", new String[]{"奥氮平口崩片[喜奥宁]","5毫克*14片","河北龙海药业有限公司","17.67","盒"});
            put(i++ + "", new String[]{"氟哌啶醇片","2mg*100片","宁波大红鹰药业股份有限公司","52.49","瓶"});
            put(i++ + "", new String[]{"盐酸哌罗匹隆片[康尔汀]","4mg*30片","丽珠集团丽珠制药厂","73.30","盒"});
            put(i++ + "", new String[]{"五氟利多片","20mg*24片","江苏恩华药业股份有限公司","49.80","瓶"});
            put(i++ + "", new String[]{"丙戊酸钠缓释片(I)[喜复至]","0.5克*30片","台湾信东生技股份有限公司","52.32","瓶"});
            put(i++ + "", new String[]{"利培酮片","1mg*30片","常州四药制药有限公司","3.60","瓶"});
            put(i++ + "", new String[]{"氘丁苯那嗪片[安泰坦]","6毫克*28片","美国Anesta","LLC","2,189.60","盒"});
            put(i++ + "", new String[]{"丙戊酸钠缓释片(I)[德巴金]","0.5g*30片","赛诺菲（杭州）制药有限公司","60.30","瓶"});
            put(i++ + "", new String[]{"帕利哌酮缓释片[芮达]","3mg*7片","西安杨森制药有限公司","147.40","盒"});
            put(i++ + "", new String[]{"碳酸锂缓释片","0.3g*100片","江苏恩华药业股份有限公司","59.98","瓶"});
            put(i++ + "", new String[]{"盐酸鲁拉西酮片[喜赛康]","40毫克*30片","浙江海正药业股份有限公司","282.00","瓶"});
            put(i++ + "", new String[]{"帕利哌酮缓释片[芮达]","6mg*7片","西安杨森制药有限公司","250.65","盒"});
            put(i++ + "", new String[]{"阿立哌唑片[安律凡]","5mg*10片","浙江大冢制药有限公司","63.22","盒"});
            put(i++ + "", new String[]{"盐酸齐拉西酮胶囊[思贝格]","20mg*20片","江苏恩华药业股份有限公司","46.18","盒"});
            put(i++ + "", new String[]{"丙戊酸镁缓释片","0.25g*30片","湖南省湘中制药有限公司","40.42","瓶"});
            put(i++ + "", new String[]{"奥氮平片[欧兰宁]","5毫克*28片","江苏豪森制药有限公司","97.50","盒"});
            put(i++ + "", new String[]{"利培酮口崩片[醒志]","1mg*30片","齐鲁制药有限公司","38.28","盒"});
            put(i++ + "", new String[]{"氯氮平口腔崩解片","0.1g*50片","湖南洞庭药业股份有限公司","30.94","盒"});
            put(i++ + "", new String[]{"帕利哌酮缓释片[艾兰宁]","6毫克*7片","江苏豪森制药有限公司","219.95","盒"});
            put(i++ + "", new String[]{"氯氮平片[常键]","25毫克*100片","万邦德制药集团有限公司","5.00","瓶"});
            put(i++ + "", new String[]{"碳酸锂片","0.25g*100片","湖南千金湘江药业股份有限公司","25.00","瓶"});
            put(i++ + "", new String[]{"奋乃静片","2mg*100片","上海朝晖药业有限公司","17.56","瓶"});
            put(i++ + "", new String[]{"帕利哌酮缓释片[艾兰宁]","3毫克*14片","江苏豪森制药有限公司","258.77","盒"});
            put(i++ + "", new String[]{"茴拉西坦分散片[顺坦]","0.1g*50片","西安海欣制药有限公司","28.68","盒"});
            put(i++ + "", new String[]{"石杉碱甲片[忆诺]","50ug*30片","北京华素制药股份有限公司","18.77","盒"});
            put(i++ + "", new String[]{"氢溴酸加兰他敏片[金康灵力]","5毫克*30片","浙江金华康恩贝生物制药有限公司","158.64","盒"});
            put(i++ + "", new String[]{"(ZD)丁苯酞软胶囊[恩必普]","0.1g*24粒","石药集团恩必普药业有限公司","80.64","瓶"});
            put(i++ + "", new String[]{"(ZD)奥拉西坦胶囊[健朗星]","0.4g*24片","湖南健朗药业有限责任公司","82.68","盒"});
            put(i++ + "", new String[]{"吡拉西坦片","0.4g*100片","杭州民生药业有限公司","19.32","瓶"});
            put(i++ + "", new String[]{"甘露特钠胶囊[九期一]","150mg*42粒","上海绿谷制药有限公司","296.10","盒"});
            put(i++ + "", new String[]{"盐酸美金刚片[海沐宁]","10毫克*14片","湖南洞庭药业股份有限公司","15.26","盒"});
            put(i++ + "", new String[]{"氢溴酸加兰他敏分散片","5毫克*24片","浙江一新制药股份有限公司","108.30","盒"});
            put(i++ + "", new String[]{"尼麦角林片[思尔明]","10mg*30片","辉瑞制药有限公司","46.31","盒"});
            put(i++ + "", new String[]{"盐酸多奈哌齐片[诗乐普]","5mg*10片","江苏豪森制药有限公司","11.21","盒"});
            put(i++ + "", new String[]{"胞磷胆碱钠片","0.1g*24片","济南利民制药有限公司","38.02","盒"});
            put(i++ + "", new String[]{"重酒石酸卡巴拉汀胶囊[艾斯能]","1.5mg*28粒","诺华制药有限公司","183.39","盒"});
            put(i++ + "", new String[]{"拉莫三嗪片[利必通]","50mg*30片","英国葛兰素史克有限公司","85.87","盒"});
            put(i++ + "", new String[]{"苯妥英钠片","0.1g*100片","天津力生制药股份有限公司","17.29","瓶"});
            put(i++ + "", new String[]{"(ZD)胞磷胆碱钠胶囊[思考林]","0.1g*42粒","齐鲁制药有限公司","53.48","盒"});
            put(i++ + "", new String[]{"盐酸多奈哌齐片[安理申]","5mg*7片","苏州卫材制药有限公司","95.48","盒"});
            put(i++ + "", new String[]{"盐酸美金刚片[易倍申]","10mg*28片","德国Rottendoef","Pharma","Gmbh(灵北制药[","252.08","盒"});
            put(i++ + "", new String[]{"托吡酯片[妥泰]","25mg*60片","西安杨森制药有限公司","76.57","瓶"});
            put(i++ + "", new String[]{"加巴喷丁胶囊[迭力]","0.3g*24粒","江苏恩华药业股份有限公司","13.72","盒"});
            put(i++ + "", new String[]{"加巴喷丁片[维诺定]","0.3g*20片","海南赛立克药业有限公司","30.40","盒"});
            put(i++ + "", new String[]{"卡马西平片[得理多]","0.2g*30片","北京诺华制药有限公司","25.13","盒"});
            put(i++ + "", new String[]{"奥卡西平片[万仪]","0.3g*20片","武汉人福药业有限公司","33.02","盒"});
            put(i++ + "", new String[]{"卡马西平片","0.1g*100片","江苏恩华药业股份有限公司","17.42","瓶"});
            put(i++ + "", new String[]{"奥卡西平片[仁澳]","0.3g*30片","北京四环制药有限公司","40.20","盒"});
            put(i++ + "", new String[]{"左乙拉西坦片[开浦兰]","0.5g*30片","比利时UCB","Pharma","S.","A.(优时比珠海)","200.43","盒"});
            put(i++ + "", new String[]{"左乙拉西坦片[吉易克]","0.5g*30片","浙江京新药业股份有限公司","122.03","盒"});
            put(i++ + "", new String[]{"托吡酯片[妥泰]","0.1g*60片","西安杨森制药有限公司","232.83","瓶"});
            put(i++ + "", new String[]{"拉莫三嗪片[华斯维]","50毫克*30片","浙江华海药业股份有限公司","77.10","盒"});
            put(i++ + "", new String[]{"盐酸多奈哌齐片[思博海]","5毫克*7片","植恩生物技术股份有限公司","7.96","盒"});
            put(i++ + "", new String[]{"盐酸美金刚口服溶液","240毫克/120毫升*1瓶","海达舍画阁药业有限公司","216.00","瓶"});
            put(i++ + "", new String[]{"安脑片","0.5g*24片","哈尔滨蒲公英药业有限公司","74.42","盒"});
            put(i++ + "", new String[]{"养血清脑丸","2.5g*15袋","天士力制药集团股份有限公司","34.44","盒"});
            put(i++ + "", new String[]{"复方丹参片","0.32g*120片","云南白药集团股份有限公司","19.01","瓶"});
            put(i++ + "", new String[]{"六味安神胶囊","0.45克*24粒","重庆华森制药股份有限公司","55.09","盒"});
            put(i++ + "", new String[]{"舒眠胶囊","0.4克*36粒","贵州大隆药业有限责任公司","32.20","盒"});
            put(i++ + "", new String[]{"复方益肝灵胶囊","0.3克*36粒","天地恒一制药股份有限公司","30.89","盒"});
            put(i++ + "", new String[]{"乌灵胶囊","0.33g*36粒","浙江佐力药业股份有限公司","42.07","盒"});
            put(i++ + "", new String[]{"水飞蓟宾胶囊","35mg*30粒","天津天士力圣特制药有限公司","39.11","盒"});
            put(i++ + "", new String[]{"强力定眩片","0.35g*60片","陕西汉王药业有限公司","36.83","盒"});
            put(i++ + "", new String[]{"枣仁安神颗粒","5g*10袋","台州南峰药业有限公司","49.80","盒"});
            put(i++ + "", new String[]{"银杏叶胶囊","0.25g*20片","湖南汉森制药有限公司","33.30","瓶"});
            put(i++ + "", new String[]{"舒肝解郁胶囊","0.36g*28粒","成都康弘药业集团股份有限公司","50.48","盒"});
            put(i++ + "", new String[]{"舒肝解郁胶囊","0.36g*28粒","四川济生堂药业有限公司","50.47","盒"});
            put(i++ + "", new String[]{"稳心颗粒","9g*9袋","山东步长制药股份有限公司","23.06","盒"});
            put(i++ + "", new String[]{"银杏叶片[天保宁]","30片","浙江康恩贝制药有限公司","17.74","盒"});
            put(i++ + "", new String[]{"灯盏生脉胶囊","0.18g*30粒","云南生物谷药业有限公司","59.91","盒"});
            put(i++ + "", new String[]{"脑安颗粒","1.2g*10袋","河南省百泉制药有限公司","36.77","盒"});
            put(i++ + "", new String[]{"血塞通片","50mg*40片","云南特安呐制药股份有限公司","20.49","盒"});
            put(i++ + "", new String[]{"冠脉宁胶囊","0.33g*60粒","江西山高制药有限公司","48.03","盒"});
            put(i++ + "", new String[]{"静灵口服液","10毫升*10支","辽宁东方人药业有限公司","128.00","盒"});
            put(i++ + "", new String[]{"黄芪生脉饮口服液","10ml*10支","浙江新光药业股份有限公司","15.70","盒"});
            put(i++ + "", new String[]{"小儿智力糖浆","10ml*10支","安庆汇达丰(上海宝龙)药业有限公司","26.02","盒"});
            put(i++ + "", new String[]{"通便灵胶囊","0.25g*48粒","翔宇药业股份有限公司","33.85","盒"});
            put(i++ + "", new String[]{"复方海蛇胶囊[喜恩开]","0.3g*30粒","浙江杭康药业有限公司","58.33","盒"});
            put(i++ + "", new String[]{"九味镇心颗粒","6g*10袋","北京北陆药业有限公司","54.73","盒"});
            put(i++ + "", new String[]{"芪黄通秘软胶囊","0.5克*24粒","神威药业有限公司","43.92","盒"});
            put(i++ + "", new String[]{"藿香正气软胶囊","0.45g*24粒","石家庄神威药业股份有限公司","17.00","盒"});
            put(i++ + "", new String[]{"护肝宁片","0.35g*100片","贵州信邦制药股份有限公司","30.15","瓶"});
            put(i++ + "", new String[]{"清咽滴丸","20mg*80丸","天津中新药业集团股份有限公司第六中药","26.65","盒"});
            put(i++ + "", new String[]{"三九胃泰颗粒","20g*10包","华润三九医药股份有限公司","21.00","盒"});
            put(i++ + "", new String[]{"逍遥丸","200粒","仲景宛西制药股份有限公司","21.49","瓶"});
            put(i++ + "", new String[]{"麻仁丸","60g","杭州胡庆余堂制药业有限公司","22.91","瓶"});
            put(i++ + "", new String[]{"云南白药胶囊","0.25g*16片","云南白药集团股份有限公司","17.64","盒"});
            put(i++ + "", new String[]{"六味地黄丸","1丸*200丸","仲景宛西制药股份有限公司","25.22","瓶"});
            put(i++ + "", new String[]{"藿香正气水","10ml*10支","云南白药集团股份有限公司","13.04","盒"});
            put(i++ + "", new String[]{"冠心宁片","0.38克*18片","正大青春宝药业有限公司","137.38","盒"});
            put(i++ + "", new String[]{"护肝片","0.36g*100片","黑龙江五常葵花药业有限公司","30.00","瓶"});
            put(i++ + "", new String[]{"麻仁软胶囊","0.6g*20粒","天津市中央药业有限公司","12.14","盒"});
            put(i++ + "", new String[]{"牛黄解毒片","24片","贵州百灵企业集团制药股份有限公司","3.82","袋"});
            put(i++ + "", new String[]{"清开灵颗粒","10g*20袋","广州白云山明兴制药有限公司","20.57","盒"});
            put(i++ + "", new String[]{"普乐安胶囊[康先生]","0.375g*120粒","浙江康恩贝制药有限公司","21.97","瓶"});
            put(i++ + "", new String[]{"尿感宁颗粒[无蔗糖]","5g*24袋","正大青春宝药业有限公司","24.97","盒"});
            put(i++ + "", new String[]{"尿感宁颗粒[无蔗糖]","5克*24袋","正大青春宝药业有限公司","26.16","盒"});
            put(i++ + "", new String[]{"速效救心丸","40mg*150粒","天津中新药业集团股份有限公司第六中药","38.00","盒"});
            put(i++ + "", new String[]{"养胃颗粒[无糖型]","5g*12袋","正大青春宝药业有限公司","16.44","盒"});
            put(i++ + "", new String[]{"养胃颗粒[无蔗糖]","5g*24袋","正大青春宝药业有限公司","29.66","盒"});
            put(i++ + "", new String[]{"芪胶升白胶囊","0.5g*36粒","贵州汉方药业有限公司","44.62","盒"});
            put(i++ + "", new String[]{"双黄连口服液","10ml*12支","河南太龙药业股份有限公司","15.63","盒"});
            put(i++ + "", new String[]{"银杏叶口服液","10毫升*6支","浙江圣博康药业有限公司","72.00","盒"});
            put(i++ + "", new String[]{"康复新液","100ml","昆明赛诺制药有限公司","30.96","瓶"});
            put(i++ + "", new String[]{"板蓝根颗粒","10g*20袋","广州白云山和记黄埔中药有限公司","21.00","包"});
            put(i++ + "", new String[]{"强力枇杷露","100ml","杭州胡庆余堂制药业有限公司","7.56","瓶"});
            put(i++ + "", new String[]{"苁蓉通便口服液","10ml*6支","甘肃天水制药厂","22.58","盒"});
            put(i++ + "", new String[]{"洁尔阴洗液","350ml*1瓶","成都恩威制药有限公司","15.60","瓶"});
            put(i++ + "", new String[]{"锡类散","1g*1瓶","精华制药集团股份有限公司","3.50","瓶"});
            put(i++ + "", new String[]{"风油精","6ml*1瓶","浙江景岳堂药业（原绍兴华通）","1.50","瓶"});
            put(i++ + "", new String[]{"马应龙麝香痔疮膏","20g*1支","马应龙药业集团股份有限公司","13.80","盒"});
            put(i++ + "", new String[]{"麝香镇痛膏","10贴","浙江鼎泰药业有限公司","9.44","盒"});
            put(i++ + "", new String[]{"骨通贴膏（聚异丁烯型）","5贴*2袋","桂林天和药业股份有限公司","32.18","盒"});
            put(i++ + "", new String[]{"糠酸莫米松乳膏[艾洛松]","5g*1支","拜耳医药（上海）有限公司","11.91","支"});
            put(i++ + "", new String[]{"醋酸氟轻松乳膏","20g*1支","天津太平洋制药有限公司","1.90","支"});
            put(i++ + "", new String[]{"双氯芬酸二乙铵乳胶剂[扶他林]","20g*1支","北京诺华制药有限公司","17.18","支"});
            put(i++ + "", new String[]{"吲哚美辛栓","0.1g*10粒","湖北东信药业有限公司","6.29","盒"});
            put(i++ + "", new String[]{"利多卡因氯已定气雾剂[好得快]","60g*1瓶","广东同德药业有限公司","8.82","瓶"});
            put(i++ + "", new String[]{"曲安奈德益康唑乳膏[派瑞松]","15g*1支","西安杨森制药有限公司","14.79","支"});
            put(i++ + "", new String[]{"开塞露","20ml*1支","杏辉天力（杭州）药业有限公司","0.98","支"});
            put(i++ + "", new String[]{"莫匹罗星软膏[百多邦]","2%","10g*1支","中美天津史克制药有限公司","20.18","支"});
            put(i++ + "", new String[]{"红霉素软膏","10g*1支","福元药业(安徽新和成皖南药业有限公司)","2.50","支"});
            put(i++ + "", new String[]{"硝酸咪康唑乳膏","2%","15g*1支","福元药业(安徽新和成皖南药业有限公司)","2.01","支"});
            put(i++ + "", new String[]{"左氧氟沙星滴眼液[万汉润舒]","24.4毫克/5毫升*1支","中山万汉制药有限公司","6.95","支"});
            put(i++ + "", new String[]{"聚维酮碘溶液","5%","100ml*1瓶","杭州民生药业有限公司","6.06","瓶"});
            put(i++ + "", new String[]{"苯扎氯铵贴[邦迪]","100张","上海强生制药有限公司","16.53","盒"});
            put(i++ + "", new String[]{"盐酸氨溴索葡萄糖注射液[菲得欣]","30mg/50ml*1瓶","石家庄四药有限公司","9.19","瓶"});
            put(i++ + "", new String[]{"5%葡萄糖注射液[软袋]","50毫升*1袋","杭州民生药业有限公司","3.06","袋"});
            put(i++ + "", new String[]{"葡萄糖氯化钠注射液[软袋]","500毫升*1袋","杭州民生药业有限公司","3.94","袋"});
            put(i++ + "", new String[]{"5%葡萄糖注射液[软袋]","500毫升*1袋","杭州民生药业有限公司","3.83","袋"});
            put(i++ + "", new String[]{"0.9%氯化钠注射液[软袋]","500毫升*1袋","杭州民生药业有限公司","3.87","袋"});
            put(i++ + "", new String[]{"复方右旋糖酐40注射液","1袋/500毫升*1袋","山东华鲁制药有限公司","93.29","袋"});
            put(i++ + "", new String[]{"甘露醇注射液[软袋]","50g/250ml*1袋","上海百特医疗用品有限公司","7.97","袋"});
            put(i++ + "", new String[]{"碳酸氢钠注射液(塑)","12.5g/250ml*1瓶","回音必集团（江西）东亚制药有限公司","5.29","瓶"});
            put(i++ + "", new String[]{"盐酸纳洛酮注射液","0.4mg/1ml*1支","江苏恩华药业股份有限公司","1.15","支"});
            put(i++ + "", new String[]{"灭菌注射用水","5ml*1支","遂成药业股份有限公司","0.22","支"});
            put(i++ + "", new String[]{"灭菌注射用水","5ml*1支","浙江瑞新药业有限公司","0.12","支"});
            put(i++ + "", new String[]{"注射用头孢哌酮钠舒巴坦钠[舒普深]","1g*1瓶","辉瑞制药有限公司","48.16","瓶"});
            put(i++ + "", new String[]{"注射用头孢呋辛钠","0.75克*1瓶","齐鲁制药有限公司","1.35","瓶"});
            put(i++ + "", new String[]{"注射用青霉素钠","80万U*1瓶","华北制药集团制剂有限公司","3.80","瓶"});
            put(i++ + "", new String[]{"注射用青霉素钠","80万U*1瓶","山东鲁抗医药股份有限公司","3.50","瓶"});
            put(i++ + "", new String[]{"甲硝唑氯化钠注射液[直立式软袋]","0.5g/100ml*1瓶","四川科伦药业股份有限公司","2.39","瓶"});
            put(i++ + "", new String[]{"阿米卡星注射液","0.2g/2ml*1支","浙江诚意药业股份有限公司","1.00","支"});
            put(i++ + "", new String[]{"(ZD)注射用拉氧头孢钠[噻吗灵]","1g*1瓶","海南海灵化学制药有限公司","78.95","瓶"});
            put(i++ + "", new String[]{"注射用头孢曲松钠","0.5克*1瓶","深圳立健药业有限公司","1.57","瓶"});
            put(i++ + "", new String[]{"注射用头孢曲松钠[罗氏芬]","1g*1瓶","上海罗氏制药有限公司","36.02","瓶"});
            put(i++ + "", new String[]{"氯化钠注射液（塑）","0.9%","10ml*1支","中国大冢制药有限公司","1.07","支"});
            put(i++ + "", new String[]{"甲氧氯普胺注射液","10mg/1ml*1支","遂成药业股份有限公司","2.85","支"});
            put(i++ + "", new String[]{"盐酸雷尼替丁注射液","2ml/50mg*1支","上海现代哈森商丘药业有限公司","2.38","支"});
            put(i++ + "", new String[]{"酚磺乙胺注射液","0.5g/2ml*1支","天津金耀集团湖北天药药业股份有限公司","2.50","支"});
            put(i++ + "", new String[]{"山莨菪碱注射液","10mg*1支","杭州民生药业有限公司","2.38","支"});
            put(i++ + "", new String[]{"(ZD)注射用奥美拉唑钠[瑞勃奇]","20mg*1瓶","海南灵康制药有限公司","12.40","瓶"});
            put(i++ + "", new String[]{"氯苯那敏注射液","10mg/1ml*1支","遂成药业股份有限公司","1.25","支"});
            put(i++ + "", new String[]{"地塞米松注射液","5mg/1ml*1支","天津金耀集团湖北天药药业股份有限公司","1.08","支"});
            put(i++ + "", new String[]{"注射用甲泼尼龙琥珀酸钠[甲强龙]","40mg*1盒","Pfizer","Manufacturing","Belgium","NV","23.24","盒"});
            put(i++ + "", new String[]{"东莨菪碱注射液","0.3mg/1ml*1支","遂成药业股份有限公司","68.00","支"});
            put(i++ + "", new String[]{"氟哌啶醇注射液","5mg/1ml*1支","湖南洞庭药业股份有限公司","25.80","支"});
            put(i++ + "", new String[]{"棕榈酸帕利哌酮注射液[善思达]","150mg/1.5ml*1支","Janssen","Pharmaceutica","N.V.","2,533.00","支"});
            put(i++ + "", new String[]{"注射用丙戊酸钠[德巴金]","0.4g/1盒*1盒","赛诺菲（杭州）制药有限公司","113.65","盒"});
            put(i++ + "", new String[]{"棕榈帕利哌酮酯注射液(3M)[善妥达]","350毫克/1.75毫升*1支","Janssen","Pharmaceutica","N.V.","4,726.80","支"});
            put(i++ + "", new String[]{"棕榈酸帕利哌酮注射液[善思达]","100mg/1.0ml*1支","Janssen","Pharmaceutica","N.V.","1,857.08","支"});
            put(i++ + "", new String[]{"吸入用布地奈德混悬液[普米克令舒]","1mg/2ml*5支","AstraZeneca","UK","Limited","64.70","袋"});
            put(i++ + "", new String[]{"吸入用异丙托溴铵溶液[爱全乐]","500ug/2ml*1支","法国","Laboratoir","e","unither","3.86","支"});
            put(i++ + "", new String[]{"硫酸特布他林雾化液[博利康尼]","5mg/2ml*20支","AstraZeneca","UK","Limited","95.40","盒"});
            put(i++ + "", new String[]{"0.9%氯化钠注射液[软袋]","100毫升*1袋","杭州民生药业有限公司","3.12","袋"});
            put(i++ + "", new String[]{"0.9%氯化钠注射液[软袋]","250毫升*1袋","杭州民生药业有限公司","3.38","袋"});
            put(i++ + "", new String[]{"乳酸左氧氟沙星氯化钠注射液[来立信]","0.5g/250ml*1瓶","浙江医药股份有限公司新昌制药厂","41.17","瓶"});
            put(i++ + "", new String[]{"左氧氟沙星氯化钠注射液","0.5克/100毫升*1瓶","浙江医药股份有限公司新昌制药厂","17.50","瓶"});
            put(i++ + "", new String[]{"复方氯化钠注射液[非PVC膜]+[双管双塞]","500ml*1袋","四川科伦药业股份有限公司","3.49","袋"});
            put(i++ + "", new String[]{"肾上腺素注射液","1mg/1ml*1支","上海禾丰制药有限公司","5.00","支"});
            put(i++ + "", new String[]{"重酒石酸去甲肾上腺素注射液","2mg/1ml*1支","远大医药（中国）有限公司","22.00","支"});
            put(i++ + "", new String[]{"多巴酚丁胺注射液","20mg/2ml*1支","山东方明药业集团股份有限公司","35.00","支"});
            put(i++ + "", new String[]{"间羟胺注射液","10mg/1ml*1支","北京市永康药业有限公司","65.00","支"});
            put(i++ + "", new String[]{"多巴胺注射液","20mg/2ml*1支","上海禾丰制药有限公司","3.98","支"});
            put(i++ + "", new String[]{"肝素钠注射液","12500U/2ml*1支","常州千红生化制药股份有限公司","11.98","支"});
            put(i++ + "", new String[]{"葡萄糖酸钙注射液","1g/10ml*1支","扬州中宝制药有限公司","9.40","支"});
            put(i++ + "", new String[]{"浓氯化钠注射液","1g/10ml*1支","湖北天圣药业有限公司","0.37","支"});
            put(i++ + "", new String[]{"硫酸镁注射液","2.5g/10ml*1支","杭州民生药业有限公司","7.60","支"});
            put(i++ + "", new String[]{"氯化琥珀胆碱注射液[司可林]","0.1g/2ml*1支","上海旭东海普药业有限公司","56.00","支"});
            put(i++ + "", new String[]{"氯化钾注射液(塑)","10%","10ml*1支","中国大冢制药有限公司","1.16","支"});
            put(i++ + "", new String[]{"盐酸胺碘酮注射液[可达龙]","0.15g/3ml*1支","杭州赛诺菲安万特民生制药有限公司","24.43","支"});
            put(i++ + "", new String[]{"异丙肾上腺素注射液","1mg/2ml*1支","上海禾丰制药有限公司","39.80","支"});
            put(i++ + "", new String[]{"异丙嗪注射液","50mg/2ml*1支","上海禾丰制药有限公司","2.60","支"});
            put(i++ + "", new String[]{"利多卡因注射液","0.1g/5ml*1支","天津金耀集团湖北天药药业股份有限公司","4.86","支"});
            put(i++ + "", new String[]{"钆喷酸葡胺注射液[马根维显]","7.04g/15ml*1瓶","拜耳医药保健有限公司广州分公司","149.55","瓶"});
            put(i++ + "", new String[]{"去乙酰毛花苷注射液","0.4mg/2ml*1支","上海旭东海普药业有限公司","86.00","支"});
            put(i++ + "", new String[]{"阿托品注射液","0.5mg/1ml*1支","河南润弘制药股份有限公司","6.67","支"});
            put(i++ + "", new String[]{"二羟丙茶碱注射液","0.25g/2ml*1支","上海现代哈森商丘药业有限公司","1.25","支"});
            put(i++ + "", new String[]{"氨茶碱注射液","0.25g/10ml*1支","常州兰陵制药有限公司","19.80","支"});
            put(i++ + "", new String[]{"50%葡萄糖注射液（塑）","50%","20ml*1支","中国大冢制药有限公司","1.13","支"});
            put(i++ + "", new String[]{"丙泊酚乳状注射液[静安]","0.2g/20ml*1支","北京费森尤斯卡比医药有限公司","23.61","支"});
            put(i++ + "", new String[]{"复方氨基酸注射液18AA-I[凡命]","250ml*1瓶","费森尤斯卡比华瑞制药有限公司","18.00","瓶"});
            put(i++ + "", new String[]{"依托咪酯乳状注射液[福尔利]","20mg/10ml*1支","江苏恩华药业股份有限公司","37.74","支"});
            put(i++ + "", new String[]{"盐酸普罗帕酮注射液","70mg/20ml*1支","上海信谊金朱药业有限公司","50.00","支"});
            put(i++ + "", new String[]{"硝酸甘油注射液","5mg/1ml*1支","山东圣鲁制药有限公司","18.50","支"});
            put(i++ + "", new String[]{"呋塞米注射液","20mg/2ml*1支","上海禾丰制药有限公司","2.68","支"});
            put(i++ + "", new String[]{"呋塞米注射液","20mg/2ml*1支","天津金耀集团湖北天药药业股份有限公司","0.72","支"});
            put(i++ + "", new String[]{"甲硫酸新斯的明注射液","0.5毫克/1毫升*1支","河南润弘制药股份有限公司","36.00","支"});
            put(i++ + "", new String[]{"尼可刹米注射液","0.375g/1.5ml*1支","上海禾丰制药有限公司","6.80","支"});
            put(i++ + "", new String[]{"洛贝林注射液","3mg/1ml*1支","上海禾丰制药有限公司","20.80","支"});
            put(i++ + "", new String[]{"甲钴胺注射液[弥可保]","0.5mg/1ml*1支","卫材（中国）制药有限公司","14.04","支"});
            put(i++ + "", new String[]{"维生素B12注射液","1mg/1ml*1支","遂成药业股份有限公司","1.86","支"});
            put(i++ + "", new String[]{"维生素B1注射液","0.1g/2ml*1支","杭州民生药业有限公司","0.48","支"});
            put(i++ + "", new String[]{"维生素C注射液","1g/5ml*1支","常州制药厂有限公司","0.70","支"});
            put(i++ + "", new String[]{"维生素B6注射液","0.1g/2ml*1支","山西晋新双鹤药业有限公司","1.92","支"});
            put(i++ + "", new String[]{"(ZD)舒血宁注射液","5ml*1支","神威药业有限公司","14.18","支"});
            put(i++ + "", new String[]{"(ZD)银杏达莫注射液","5ml*1支","贵州益佰制药股份有限公司","10.76","支"});
            put(i++ + "", new String[]{"复方甘草酸苷注射液[美能]","40mg/20ml*1支","日本米诺发源制药(卫才中国分装)","16.09","支"});
            put(i++ + "", new String[]{"10%葡萄糖注射液[软袋]","250毫升*1袋","杭州民生药业有限公司","3.36","袋"});
            put(i++ + "", new String[]{"葡萄糖氯化钠注射液[软袋]","250毫升*1袋","杭州民生药业有限公司","3.46","袋"});
            put(i++ + "", new String[]{"10%葡萄糖注射液[软袋]","500毫升*1袋","杭州民生药业有限公司","3.83","袋"});
            put(i++ + "", new String[]{"5%葡萄糖注射液[软袋]","250毫升*1袋","杭州民生药业有限公司","3.36","袋"});
            put(i++ + "", new String[]{"(ZD)注射用胸腺法新[日达仙]","1.6mg*1支","意大利蒙莎培森药厂","450.00","支"});
            put(i++ + "", new String[]{"人血白蛋白注射液","20%","10g/50ml*1瓶","(美国）Grifols","Biologicals","Inc.","420.00","瓶"});
            put(i++ + "", new String[]{"人血白蛋白注射液","20%","10g/50ml*1瓶","奥克特珐玛AB公司（瑞典）","420.00","瓶"});
            put(i++ + "", new String[]{"破伤风抗毒素注射液","1500IU*1支","江西生物制品研究所","15.60","支"});
            put(i++ + "", new String[]{"甘精胰岛素注射液[来得时]","300单位/3ml*1支","赛诺菲（北京）制药有限公司","183.12","支"});
            put(i++ + "", new String[]{"胰岛素针","400IU/10ml*1瓶","江苏万邦生化医药集团有限责任公司","23.82","瓶"});
            put(i++ + "", new String[]{"精蛋白人胰岛素混合注射液[诺和灵30R","300IU/3ml*1支","诺和诺德(中国)制药有限公司","49.18","盒"});
            put(i++ + "", new String[]{"双歧杆菌四联活菌片[思连康]","0.5克*30片","杭州远大生物制药有限公司","30.57","盒"});
            put(i++ + "", new String[]{"地特胰岛素注射液（特充）[诺和平]","300IU/3ml*1支","诺和诺德(中国)制药有限公司","191.44","支"});
            put(i++ + "", new String[]{"门冬胰岛素30注射液[诺和锐30特充]","300单位*1支","诺和诺德(中国)制药有限公司","77.12","盒"});
            put(i++ + "", new String[]{"注射用利培酮微球(II)[瑞欣妥]","25毫克*1瓶","山东绿叶制药有限公司","678.00","盒"});
            put(i++ + "", new String[]{"注射用利培酮微球(II)[瑞欣妥]","37.5毫克*1瓶","山东绿叶制药有限公司","924.77","盒"});
            put(i++ + "", new String[]{"枸橼酸他莫昔芬片","10mg*60片","扬子江药业股份有限公司","72.00","瓶"});
            put(i++ + "", new String[]{"阿莫西林克拉维酸钾(4:1)颗粒[安奇]","156.25mg*9包","海南先声药业有限公司","9.09","盒"});
            put(i++ + "", new String[]{"阿德福韦酯片[贺维力]","10mg*14片","葛兰素史克（天津）有限公司","148.13","瓶"});
            put(i++ + "", new String[]{"复方甘草酸苷片[美能]","25mg*100片","日本秋山片剂株式会社（Akiyama","Jozai","118.71","盒"});
            put(i++ + "", new String[]{"乳果糖口服溶液[杜密克]","15ml*6袋","荷兰苏威制药公司","31.92","盒"});
            put(i++ + "", new String[]{"双歧杆菌三联活菌散[","培菲康]","1g*7袋","上海医药有限公司信谊制药总厂","17.69","盒"});
            put(i++ + "", new String[]{"那屈肝素钙注射液[速碧林]","4100IU/0.4ml*1支","葛兰素史克（天津）有限公司","49.87","支"});
            put(i++ + "", new String[]{"瑞舒伐他汀钙片[可定]","10mg*7片","阿斯利康药业(中国)分包装IPR","PHARMAC","38.80","盒"});
            put(i++ + "", new String[]{"氧氟沙星眼膏[泰利必妥]","3.5克*1支","日本参天制药株式会社","23.43","盒"});
            put(i++ + "", new String[]{"布地奈德福莫特罗粉吸入剂","4.5微克/160微克*60吸","AstraZeneca","AB","220.18","瓶"});
            put(i++ + "", new String[]{"孟鲁司特钠咀嚼片[顺尔宁]","4mg*5片","杭州默沙东制药有限公司","19.47","盒"});
            put(i++ + "", new String[]{"拉米夫定片[贺普丁]","0.1g*14片","苏州葛兰素史克制药[苏州]有限公司","128.30","盒"});
            put(i++ + "", new String[]{"阿奇霉素干混悬剂[希舒美]","0.1g*6袋","辉瑞制药有限公司","33.50","盒"});
            put(i++ + "", new String[]{"葡萄糖酸锌颗粒","35mg*16包","浙江杭康药业有限公司","25.40","盒"});
            put(i++ + "", new String[]{"艾司奥美拉唑镁肠溶片[耐信]","20mg*7片","阿斯利康制药有限公司","57.35","盒"});
            put(i++ + "", new String[]{"培哚普利片[雅施达]","4mg*30片","施维雅[天津]制药有限公司","80.66","盒"});
            put(i++ + "", new String[]{"糠酸莫米松鼻喷雾剂[内舒拿]","0.05%50ug*60揿","Schering-Plough Labo N.V.","56.40","瓶"});
            put(i++ + "", new String[]{"玻璃酸钠滴眼液","0.1g/10ml*1支","德国URSAP","HARM","Arzneimittel","GmbH","53.83","支"});
            put(i++ + "", new String[]{"芙朴感冒颗粒","10g*10包","浙江天一堂药业有限公司","13.75","盒"});
            put(i++ + "", new String[]{"连花清瘟胶囊","0.35g*24粒","石家庄以岭药业股份有限公司","11.09","盒"});
            put(i++ + "", new String[]{"阿卡波糖片[拜唐苹]","0.1g*30片","拜耳医药保健有限公司","32.64","盒"});
            put(i++ + "", new String[]{"塞来昔布胶囊[西乐葆]","0.2g*6粒","美国fizer","pharmaceutica(辉瑞制药公)","27.54","盒"});
            put(i++ + "", new String[]{"恩替卡韦片[博路定]","0.5mg*7片","上海施贵宝制药有限公司","141.53","盒"});
            put(i++ + "", new String[]{"阿莫西林胶囊[阿莫灵]","0.25g*24粒","香港澳美制药厂","9.28","盒"});
            put(i++ + "", new String[]{"头孢呋辛酯片[西力欣]","0.25g*12片","葛兰素史克","26.40","盒"});
            put(i++ + "", new String[]{"铝碳酸镁咀嚼片[达喜]","0.5g*20片","拜耳医药保健有限公司启动分公司","17.06","盒"});
            put(i++ + "", new String[]{"枯草杆菌二联活菌颗粒[妈咪爱]","1g*15袋","北京韩美药品有限公司","18.69","盒"});
            put(i++ + "", new String[]{"阿托伐他汀钙片[立普妥]","20mg*7片","辉瑞制药有限公司","42.77","盒"});
            put(i++ + "", new String[]{"苯磺酸氨氯地平片[络活喜]","5mg*7片","辉瑞制药有限公司","24.01","盒"});
            put(i++ + "", new String[]{"厄贝沙坦片[安博维]","0.15g*7片","杭州赛诺菲安万特民生制药有限公司","22.24","盒"});
            put(i++ + "", new String[]{"马来酸依那普利片[依苏]","10mg*16片","扬子江药业集团江苏制药股份有限公司","8.93","盒"});
            put(i++ + "", new String[]{"左氧氟沙星滴眼液[可乐必妥]","0.5%","24.4mg/5ml*1支","参天制药（中国）有限公司","27.95","支"});
            put(i++ + "", new String[]{"安宫牛黄丸（人工麝香）","3克*1丸","杭州胡庆余堂制药业有限公司","87.52","盒"});
            put(i++ + "", new String[]{"佐匹克隆片","3.75毫克*24片","吉林金恒制药股份有限公司","36.00","盒"});
            put(i++ + "", new String[]{"右佐匹克隆片[文飞]","3mg*6片","江苏天士力帝益药业有限公司","26.70","盒"});
            put(i++ + "", new String[]{"唑吡坦片[思诺思]","10mg*7片","杭州赛诺菲圣德拉堡民生制药有限公司","20.78","盒"});
            put(i++ + "", new String[]{"马来酸咪达唑仑片[多美康]","15毫克*10片","Productos","Roche.S.A.de","C.V.","257.50","盒"});
            put(i++ + "", new String[]{"右佐匹克隆片[伊坦宁]","3mg*7片","成都康弘药业集团股份有限公司","4.30","盒"});
            put(i++ + "", new String[]{"扎来普隆胶囊[恩诺欣]","5mg*10粒","江苏恩华药业股份有限公司","46.00","盒"});
            put(i++ + "", new String[]{"劳拉西泮片[罗拉]","0.5mg*20片","Atlantic","Laboratories","Corpoaration","L","13.00","盒"});
            put(i++ + "", new String[]{"佐匹克隆片[三辰]","7.5mg*12片","齐鲁制药有限公司","35.70","盒"});
            put(i++ + "", new String[]{"劳拉西泮片","1mg*28片","湖南洞庭药业股份有限公司","28.80","盒"});
            put(i++ + "", new String[]{"佐匹克隆片[忆孟返]","7.5毫克*20片","赛诺菲（杭州）制药有限公司","52.00","盒"});
            put(i++ + "", new String[]{"艾司唑仑注射液","2mg/1ml*1支","华中药业股份有限公司","50.00","支"});
            put(i++ + "", new String[]{"酒石酸唑吡坦片","10mg*6片","湖南千金湘江药业股份有限公司","17.94","盒"});
            put(i++ + "", new String[]{"地西泮注射液","10毫克/2毫升*1支","山东威智百科药业有限公司","8.50","支"});
            put(i++ + "", new String[]{"氯硝西泮片","0.5mg*100片","江苏恩华药业股份有限公司","17.24","瓶"});
            put(i++ + "", new String[]{"阿普唑仑片","0.4mg*24片","湖南洞庭药业股份有限公司","6.00","盒"});
            put(i++ + "", new String[]{"酒石酸唑吡坦口腔崩解片","10毫克*10片","陕西量子高科药业有限公司","125.00","盒"});
            put(i++ + "", new String[]{"扎来普隆分散片[安云]","5毫克*14片","三门峡赛诺维制药有限公司","42.00","盒"});
            put(i++ + "", new String[]{"奥沙西泮片[优菲]","15mg*20片","北京益民药业有限公司","72.20","盒"});
            put(i++ + "", new String[]{"艾司唑仑片[舒乐安定]","1mg*20片","山东信谊制药有限公司","9.95","盒"});
            put(i++ + "", new String[]{"氯硝西泮片[氯硝安定片]","2mg*100片","湖南洞庭药业股份有限公司","49.80","瓶"});
            put(i++ + "", new String[]{"苯巴比妥片","30mg*100片","上海上药信谊药厂有限公司","52.00","瓶"});
            put(i++ + "", new String[]{"癸酸氟哌啶醇注射液[哈力多]","50mg/1ml*1支","泰国大西洋制药有限公司","29.13","支"});
            put(i++ + "", new String[]{"地西泮片[安定片]","2.5mg*20片","华中药业股份有限公司","5.80","盒"});
            put(i++ + "", new String[]{"咪达唑仑片[力月西]","15mg*10片","江苏恩华药业股份有限公司","78.00","盒"});
            put(i++ + "", new String[]{"硝西泮片","5mg*100片","江苏恩华药业股份有限公司","49.00","瓶"});
            put(i++ + "", new String[]{"劳拉西泮片[佳普乐]","1mg*24片","山东信谊制药有限公司","23.80","盒"});
            put(i++ + "", new String[]{"哌甲酯缓释片[专注达]","18mg*15片","西安杨森制药有限公司","296.85","瓶"});
            put(i++ + "", new String[]{"哌甲酯缓释片[专注达]","36mg*15片","西安杨森制药有限公司","486.00","瓶"});
            put(i++ + "", new String[]{"莫达非尼胶囊","100毫克*2粒","湘北威尔曼制药股份有限公司","330.44","盒"});
            put(i++ + "", new String[]{"盐酸吗啡注射液","10mg/1ml*1支","东北制药集团沈阳第一制药有限公司","3.72","支"});
        }
    };
}
